import React from 'react';

const PrivacyPolicyText = () => {
  return (
    <div className="space-y-8">
      <p className="mt-8">
        ○○（以下，「当社」といいます。）は，本ウェブサイト上で提供するサービス（以下,「本サービス」といいます。）における，ユーザーの個人情報の取扱いについて，以下のとおりプライバシーポリシー（以下，「本ポリシー」といいます。）を定めます。
      </p>

      <div className="space-y-6">
        <div className="space-y-2">
          <h3 className="text-lg font-bold">第1条（個人情報）</h3>
          <p>
            「個人情報」とは，個人情報保護法にいう「個人情報」を指すものとし，生存する個人に関する情報であって，当該情報に含まれる氏名，生年月日，住所，電話番号，連絡先その他の記述等により特定の個人を識別できる情報及び容貌，指紋，声紋にかかるデータ，及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。
          </p>
        </div>

        <div className="space-y-2">
          <h3 className="text-lg font-bold">第2条（個人情報の収集方法）</h3>
          <p>
            当社は，ユーザーが利用登録をする際に氏名，生年月日，住所，電話番号，メールアドレス，銀行口座番号，クレジットカード番号，運転免許証番号などの個人情報をお尋ねすることがあります。また，ユーザーと提携先などとの間でなされたユーザーの個人情報を含む取引記録や決済に関する情報を,当社の提携先（情報提供元，広告......
          </p>
        </div>

        <div className="space-y-2">
          <h3 className="text-lg font-bold">
            第3条（個人情報を収集・利用する目的）
          </h3>
          <p>
            当社が個人情報を収集・利用する目的は以下のとおりです。
            <ol className="ml-4 list-decimal">
              <li>サービスの提供・運営のため</li>
              <li>ユーザーからのお問い合わせに対する対応のため</li>
              <li>新しいサービス、キャンペーン等のお知らせのため</li>
              <li>利用規約やサービスに関する変更などの通知のため</li>
              <li>上記のサービスに付随するサービス情報を提供するため</li>
              <li>利用統計などのマーケティング分析や調査のため</li>
              <li>法令に基づく手続きに対応するため</li>
              <li>その他、ユーザーに明示した利用目的のため</li>
            </ol>
          </p>
        </div>
        <div className="space-y-2">
          <h3 className="text-lg font-bold">第4条（個人情報の第三者提供）</h3>
          <p>
            当社は、次に掲げる場合を除いて、あらかじめユーザーの同意を得ることなく、第三者に個人情報を提供することはありません。
            <ol className="ml-4 list-decimal">
              <li>法令に基づく場合</li>
              <li>
                人の生命、身体または財産の保護のために必要がある場合であって、ユーザーの同意を得ることが困難であるとき
              </li>
              <li>
                公衆衛生の向上や児童の健全な育成を図る上で特に必要がある場合であり、ユーザーの同意を得ることが困難であるとき
              </li>
              <li>
                国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合
              </li>
              <li>
                予め次の事項を告知あるいは公表をしている場合
                <ol className="ml-4 list-decimal">
                  <li>利用目的に第三者への提供を含むこと</li>
                  <li>第三者に提供されるデータの項目</li>
                  <li>第三者への提供の手段または方法</li>
                  <li>ユーザーの同意を得ることにより提供を停止する手段</li>
                </ol>
              </li>
            </ol>
          </p>
        </div>
        <div className="space-y-2">
          <h3 className="text-lg font-bold">第5条（個人情報の保護措置）</h3>
          <p>
            当社は、個人情報の正確性と安全性を保護するために、適切な管理措置を講じ、個人情報の漏洩、紛失または棄損を防止し、安全に管理します。また、個人情報を取り扱う社内の部門に対して、必要かつ適切な監督を行います。不正アクセスや個人情報の漏洩などのリスクに対しても、継続的なリスク評価とともに、防御策を実施し、改善を行っていきます。
          </p>
        </div>

        <div className="space-y-2">
          <h3 className="text-lg font-bold">
            第6条（クッキーとWebビーコンの使用）
          </h3>
          <p>
            当社のウェブサイトでは、サービス向上を目的としてクッキー（Cookies）またはWebビーコン（Web
            Beacons）を使用することがあります。これらの技術によって集められる情報は、個人を特定するものではなく、統計データとしてのみ利用します。ただし、ユーザーはブラウザの設定を変更することで、クッキーの受け取りを拒否することができますが、その場合、当社のウェブサイト上で提供されるサービスの一部にアクセスできなくなることがあります。
          </p>
        </div>

        <div className="space-y-2">
          <h3 className="text-lg font-bold">第7条（ポリシーの変更）</h3>
          <p>
            当社は、必要に応じて本ポリシーの内容を変更することがあります。変更後のプライバシーポリシーは、本ウェブサイトに公開することにより効力を生じるものとします。ユーザーは定期的にウェブサイトを訪れ、最新のプライバシーポリシーを確認することが推奨されます。
          </p>
        </div>

        <div className="space-y-2">
          <h3 className="text-lg font-bold">第8条（ユーザーの権利）</h3>
          <p>
            ユーザーは、いつでも自身の個人情報に関して、開示、訂正、追加、削除、利用停止などの要求をすることができます。
          </p>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicyText;
